'''
整型：                 0                101             -239
浮点型：               3.1415           4.2E-10         -2.33E-9
复数类型：             3.12+1.2.3j                       -1.23-93j
布尔类型：             True              False
'''
'Python123￥'                              # 使用单引号包裹
"Python4*&%"                               # 使用双引号包裹
'''Python s1 ~(())'''                      # 使用三引号包裹
[1,2,'helloe']                             # 这是一个列表
(1,2,'hello')                              # 这是一个元组
{'apple','orange',1 }                      # 这是一个集合


"""
字典中的元素是“键（Key）：值（Value）”形式的键值对，键不能重复。
Python中使用“{}”创建字典，字典中的各元素以逗号分隔
"""
# 例：{"name":"zhangsan","age":18}

li = {"name":"zhangsan","age":18}
print(li)